heatMap/heatMap_2D/buoyant2D.small/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 297;

boundaryField
{
    floor
    {
        type            empty;
    }
    ceiling
    {
        type            empty;
    }
    fixedWalls
    {
        type            zeroGradient;
    }
    rack2796428BA49E0232CAC645AEBC8DA5C1_fixedWall
    {
        type            zeroGradient;
    }
    rack2796428BA49E0232CAC645AEBC8DA5C1_inlet
    {
        //type            zeroGradient;
        //type            fixedValue;
	//value		uniform 288.15;

 type            groovyBC;
        refValue        uniform 300;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        value           uniform 300;
        valueExpression "Trackoutlet-2.00/(1.015*1.18*0.17)";
        gradientExpression "0";
        fractionExpression "1";
        evaluateDuringConstruction 0;
        variables       "Trackoutlet{rack2796428BA49E0232CAC645AEBC8DA5C1_outlet}=sum(T*mag(Sf()))/sum(mag(Sf()));";
        timelines       (
);
        lookuptables    (
);
    }
    rack2796428BA49E0232CAC645AEBC8DA5C1_outlet
    {
        type            fixedValue;
	value		uniform 300.15;
        //type            zeroGradient;
        /*type            groovyBC;
        refValue        uniform 300;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        value           uniform 300;
        valueExpression "Trackinlet+2.00/(1.015*1.18*0.17)";
        gradientExpression "0";
        fractionExpression "1";
        evaluateDuringConstruction 0;
        variables       "Trackinlet{rack2796428BA49E0232CAC645AEBC8DA5C1_inlet}=sum(T*mag(Sf()))/sum(mag(Sf()));";
        timelines       (
);
        lookuptables    (
);*/
    }

    acu380F56D59CF2B3DF6EFF9D0E6E8D39CB_fixedWall
    {
        type            zeroGradient;
    }
    /*acu380F56D59CF2B3DF6EFF9D0E6E8D39CB_inlet
    {
        type            zeroGradient;
    }
    acu380F56D59CF2B3DF6EFF9D0E6E8D39CB_outlet
    {
        type            fixedValue;
        value           uniform 289.15;
    }
    acu380F56D59CF2B3DF6EFF9D0E6E8D39CB_fixedWall
    {
        type            zeroGradient;
    }
    baffleFaces_master
    {
        type            zeroGradient;
    }
    baffleFaces_slave
    {
        type            zeroGradient;
    }*/
}


// ************************************************************************* //
