heatMap/heatMap_2D/buoyant2D.small/0.org/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            empty;
    }
    ceiling
    {
        type            empty;
    }
    fixedWalls
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    rack2796428BA49E0232CAC645AEBC8DA5C1_fixedWall
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    rack2796428BA49E0232CAC645AEBC8DA5C1_inlet
    {
        type            calculated;
        value           uniform 0;
    }
    rack2796428BA49E0232CAC645AEBC8DA5C1_outlet
    {
        type            calculated;
        value           uniform 0;
    }
    /*acu380F56D59CF2B3DF6EFF9D0E6E8D39CB_inlet
    {
        type            calculated;
        value           uniform 0;
    }
    acu380F56D59CF2B3DF6EFF9D0E6E8D39CB_outlet
    {
        type            calculated;
        value           uniform 0;
    }*/
    acu380F56D59CF2B3DF6EFF9D0E6E8D39CB_fixedWall
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }

}


// ************************************************************************* //
